src/main/resources/webServiceRequestXmls/loginRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elt="http://eltws.map.ecs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <elt:callWebServiceLogin>
         <!--Optional:-->
         <loginRequest>
            <!--Optional:-->
            <serviceCode>100</serviceCode>
            <!--Optional:-->
            <componentId>772273</componentId>
            <!--Optional:-->
            <componentAuthKey>772273</componentAuthKey>
            <!--Optional:-->
            <channel>31</channel>
            <!--Optional:-->
            <userId>772273</userId>
            <!--Optional:-->
            <password>65e8438e3fe0c513d9e0e55cd6ae2b8c2e1cd1a460378662e539358b7e55384b962ab3f18cb64b3e282ec0942d5f5aba23589b5e384a0435e7db0f876cad71e0</password>
            <!--Optional:-->
          <ip>10.168.128.238</ip>
            <!--Optional:-->
            <transactionCounter>201</transactionCounter>
            <!--Optional:-->
            <bankCode>772273</bankCode>
         </loginRequest>
      </elt:callWebServiceLogin>
   </soapenv:Body>
</soapenv:Envelope>